package com.example.models

import com.example.RV.Data

object LawList {
    val lawList = listOf<Data>(
            Data(title = "도로교통법\n" +
                    "[시행 2022. 7. 12.] [법률 제18741호, 2022. 1. 11., 일부개정]\n", content = "제25조(교차로 통행방법) ① 모든 차의 운전자는 교차로에서 우회전을 하려는 경우에는 미리 도로의 우측 가장자리를 서행하면서 우회전하여야 한다. 이 경우 우회전하는 차의 운전자는 신호에 따라 정지하거나 진행하는 보행자 또는 자전거등에 주의하여야 한다.  <개정 2020. 6. 9.>\n" +
                    "\n" +
                    "② 모든 차의 운전자는 교차로에서 좌회전을 하려는 경우에는 미리 도로의 중앙선을 따라 서행하면서 교차로의 중심 안쪽을 이용하여 좌회전하여야 한다. 다만, 시ㆍ도경찰청장이 교차로의 상황에 따라 특히 필요하다고 인정하여 지정한 곳에서는 교차로의 중심 바깥쪽을 통과할 수 있다.  <개정 2020. 12. 22.>\n" +
                    "\n" +
                    "③ 제2항에도 불구하고 자전거등의 운전자는 교차로에서 좌회전하려는 경우에는 미리 도로의 우측 가장자리로 붙어 서행하면서 교차로의 가장자리 부분을 이용하여 좌회전하여야 한다.  <개정 2020. 6. 9.>\n" +
                    "\n" +
                    "④ 제1항부터 제3항까지의 규정에 따라 우회전이나 좌회전을 하기 위하여 손이나 방향지시기 또는 등화로써 신호를 하는 차가 있는 경우에 그 뒤차의 운전자는 신호를 한 앞차의 진행을 방해하여서는 아니 된다.\n" +
                    "\n" +
                    "⑤ 모든 차 또는 노면전차의 운전자는 신호기로 교통정리를 하고 있는 교차로에 들어가려는 경우에는 진행하려는 진로의 앞쪽에 있는 차 또는 노면전차의 상황에 따라 교차로(정지선이 설치되어 있는 경우에는 그 정지선을 넘은 부분을 말한다)에 정지하게 되어 다른 차 또는 노면전차의 통행에 방해가 될 우려가 있는 경우에는 그 교차로에 들어가서는 아니 된다.  <개정 2018. 3. 27.>\n" +
                    "\n" +
                    "⑥ 모든 차의 운전자는 교통정리를 하고 있지 아니하고 일시정지나 양보를 표시하는 안전표지가 설치되어 있는 교차로에 들어가려고 할 때에는 다른 차의 진행을 방해하지 아니하도록 일시정지하거나 양보하여야 한다.\n" +
                    "\n" +
                    "[전문개정 2011. 6. 8.]\n" +
                    "\n" +
                    "제26조(교통정리가 없는 교차로에서의 양보운전) ① 교통정리를 하고 있지 아니하는 교차로에 들어가려고 하는 차의 운전자는 이미 교차로에 들어가 있는 다른 차가 있을 때에는 그 차에 진로를 양보하여야 한다.\n" +
                    "\n" +
                    "② 교통정리를 하고 있지 아니하는 교차로에 들어가려고 하는 차의 운전자는 그 차가 통행하고 있는 도로의 폭보다 교차하는 도로의 폭이 넓은 경우에는 서행하여야 하며, 폭이 넓은 도로로부터 교차로에 들어가려고 하는 다른 차가 있을 때에는 그 차에 진로를 양보하여야 한다.\n" +
                    "\n" +
                    "③ 교통정리를 하고 있지 아니하는 교차로에 동시에 들어가려고 하는 차의 운전자는 우측도로의 차에 진로를 양보하여야 한다.\n" +
                    "\n" +
                    "④ 교통정리를 하고 있지 아니하는 교차로에서 좌회전하려고 하는 차의 운전자는 그 교차로에서 직진하거나 우회전하려는 다른 차가 있을 때에는 그 차에 진로를 양보하여야 한다.\n" +
                    "\n" +
                    "[전문개정 2011. 6. 8.]\n" +
                    "\n" +
                    "제27조(보행자의 보호) ① 모든 차 또는 노면전차의 운전자는 보행자(제13조의2제6항에 따라 자전거등에서 내려서 자전거등을 끌거나 들고 통행하는 자전거등의 운전자를 포함한다)가 횡단보도를 통행하고 있거나 통행하려고 하는 때에는 보행자의 횡단을 방해하거나 위험을 주지 아니하도록 그 횡단보도 앞(정지선이 설치되어 있는 곳에서는 그 정지선을 말한다)에서 일시정지하여야 한다.  <개정 2018. 3. 27., 2020. 6. 9., 2022. 1. 11.>\n" +
                    "\n" +
                    "② 모든 차 또는 노면전차의 운전자는 교통정리를 하고 있는 교차로에서 좌회전이나 우회전을 하려는 경우에는 신호기 또는 경찰공무원등의 신호나 지시에 따라 도로를 횡단하는 보행자의 통행을 방해하여서는 아니 된다.  <개정 2018. 3. 27.>\n" +
                    "\n" +
                    "③ 모든 차의 운전자는 교통정리를 하고 있지 아니하는 교차로 또는 그 부근의 도로를 횡단하는 보행자의 통행을 방해하여서는 아니 된다.\n" +
                    "\n" +
                    "④ 모든 차의 운전자는 도로에 설치된 안전지대에 보행자가 있는 경우와 차로가 설치되지 아니한 좁은 도로에서 보행자의 옆을 지나는 경우에는 안전한 거리를 두고 서행하여야 한다.\n" +
                    "\n" +
                    "⑤ 모든 차 또는 노면전차의 운전자는 보행자가 제10조제3항에 따라 횡단보도가 설치되어 있지 아니한 도로를 횡단하고 있을 때에는 안전거리를 두고 일시정지하여 보행자가 안전하게 횡단할 수 있도록 하여야 한다.  <개정 2018. 3. 27.>\n" +
                    "\n" +
                    "⑥ 모든 차의 운전자는 다음 각 호의 어느 하나에 해당하는 곳에서 보행자의 옆을 지나는 경우에는 안전한 거리를 두고 서행하여야 하며, 보행자의 통행에 방해가 될 때에는 서행하거나 일시정지하여 보행자가 안전하게 통행할 수 있도록 하여야 한다.  <개정 2022. 1. 11.>\n" +
                    "\n" +
                    "1. 보도와 차도가 구분되지 아니한 도로 중 중앙선이 없는 도로\n" +
                    "\n" +
                    "2. 보행자우선도로\n" +
                    "\n" +
                    "3. 도로 외의 곳\n" +
                    "\n" +
                    "⑦ 모든 차 또는 노면전차의 운전자는 제12조제1항에 따른 어린이 보호구역 내에 설치된 횡단보도 중 신호기가 설치되지 아니한 횡단보도 앞(정지선이 설치된 경우에는 그 정지선을 말한다)에서는 보행자의 횡단 여부와 관계없이 일시정지하여야 한다.  <신설 2022. 1. 11.>\n" +
                    "\n" +
                    "[전문개정 2011. 6. 8.]\n" +
                    "\n" +
                    "제28조(보행자전용도로의 설치) ① 시ㆍ도경찰청장이나 경찰서장은 보행자의 통행을 보호하기 위하여 특히 필요한 경우에는 도로에 보행자전용도로를 설치할 수 있다.  <개정 2020. 12. 22.>\n" +
                    "\n" +
                    "② 차마 또는 노면전차의 운전자는 제1항에 따른 보행자전용도로를 통행하여서는 아니 된다. 다만, 시ㆍ도경찰청장이나 경찰서장은 특히 필요하다고 인정하는 경우에는 보행자전용도로에 차마의 통행을 허용할 수 있다.  <개정 2018. 3. 27., 2020. 12. 22.>\n" +
                    "\n" +
                    "③ 제2항 단서에 따라 보행자전용도로의 통행이 허용된 차마의 운전자는 보행자를 위험하게 하거나 보행자의 통행을 방해하지 아니하도록 차마를 보행자의 걸음 속도로 운행하거나 일시정지하여야 한다.\n" +
                    "\n" +
                    "[전문개정 2011. 6. 8.]")
    )

}