package com.example.models

import com.example.RV.Data

object LawList {
    val lawList = listOf<Data>(
            Data(title = "도로교통법\n", content = "[시행 2021. 5.13.] [법률 제17891호, 2021. 1.12., 일부개정]"),
        Data(title = "민법\n", content = "[시행 2021. 1.26.] [법률 제17905호, 2021. 1.26., 일부개정]"),
        Data(title = "도로의 구조ㆍ시설 기준에 관한 규칙\n", content = "[시행 2021.12.13.] [국토교통부령 제922호, 2021.12.13., 일부개정]"),
        Data(title = "농어촌도로의 구조ㆍ시설기준에 관한 규칙\n", content = "시행 2021. 5.13.] [법률 제17891호, 2021. 1.12., 일부개정]"),
        Data(title = "도시지역도로 설계 지침\n", content = "[발령 2019.12.24.] [국토교통부훈령 , 2019.12.24., 제정]"),
        Data(title = "지능형교통체계 표준 노드·링크 구축기준\n", content = "[발령 2021. 9.28.] [국토교통부고시 , 2021. 9.28., 일부개정]"),
        Data(title = "소화전의 형식승인 및 제품검사의 기술기준\n", content = "[발령 2021. 3.29.] [소방청고시 , 2021. 3.29., 일부개정]"),
        Data(title = "졸음쉼터의 설치 및 관리지침\n", content = "[발령 2020. 4.22.] [국토교통부예규 , 2020. 4.22., 일부개정]"),
        Data(title = "소화전의 우수품질인증 기술기준\n", content = "[발령 2018.12.14.] [소방청고시 , 2018.12.14., 일부개정]"),
        Data(title = "사람중심도로 설계지침\n", content = "[발령 2021. 3.25.] [국토교통부훈령 , 2021. 3.25., 제정]"),

        //문장검색
        Data(title = "도로교통법\n", content = "시행 2021. 5.13.] [법률 제17891호, 2021. 1.12., 일부개정]"),
        Data(title = "도로의 구조ㆍ시설 기준에 관한 규칙\n", content = "[시행 2021.12.13.] [국토교통부령 제922호, 2021.12.13., 일부개정]"),
        Data(title = "도로교통법 시행규칙\n", content = "[시행 2022. 7.12.] [행정안전부령 제341호, 2022. 7.11., 일부개정]"),
        Data(title = "민법\n", content = "[시행 2021. 1.26.] [법률 제17905호, 2021. 1.26., 일부개정]"),
        Data(title = "교통정온화 시설 설치 및 관리지침\n", content = "[발령 2019. 2. 1.] [국토교통부예규 , 2019. 2. 1., 제정]"),
        Data(title = "도시지역도로 설계 지침\n", content = "[발령 2019.12.24.] [국토교통부훈령 , 2019.12.24., 제정]"),
        Data(title = "도로법\n", content = "[시행 2021. 1. 1.] [법률 제17689호, 2020.12.22., 타법개정]"),
        Data(title = "사람중심도로 설계지침\n", content = "[발령 2021. 3.25.] [국토교통부훈령 , 2021. 3.25., 제정]"),
        Data(title = "교통사고조사규칙\n", content = "[발령 2021.10.12.] [경찰청훈령 , 2021.10.12., 일부개정]"),
        Data(title = "교통약자의 이동편의 증진법\n", content = "[시행 2020. 6. 9.] [법률 제17453호, 2020. 6. 9., 타법개정]")

    )

}