package com.example.models

import com.example.RV.Data

object PrecedentList {
    val precedentlist = listOf<Data>(
        Data(title="교통사고처리특례법위반\n대법원 2011.07.28 선고 2009도8222 판결\n",
            content="[판결요지]\n"
                +"정지선에서 정지하여야 하고, 나아가 우회전하여서는 아니되며,\n"+"다만 횡단보도의 보행등이 적색으로 바뀌어 횡단보도로서의 성격\n"+"을 상실한 때에는 우회전 차량은 횡단보도를 통과하여 신호에 따라 진행하는 다른 차마의 교통을 방해하지 아니하고 우회전할 수 있다."),

        Data(title="교통사고처리특례법위반\n대법원 1986.11.25 선고 86도1802 판결\n",
            content="[판결요지]\n"
                    +"편도 1차선의 내리막 길에서 우회전 신호없이 우회전하다가 사고를 낸 버스운전사에게 업무상 과실책임을 인정한 예\n" +
                "시내버스 운전사가 편도 1차선의 약 10도정도 경사진 내리막길인 교차로에서 우회전 신호를 보내지도 않고 거울을 통하여 뒤따라 오는 차량이 있는지 여부를 확인함도 없이 우회전하다가 동버스의 우측 뒤를 따라오던 오토바이를 버스의 우측 뒷바퀴 부분 차체로 충격"),

        Data(title="도로교통법위반\n대법원 2012.04.12 선고 2011도9821 판결\n",
            content="[판결요지]\n"
                +"직진 차로에서 분리된 우회전차로가 설치되어 있는 교차로에서 우회전을 하고자 하는 운전자는 특별한 사정이 없는 한 도로 우측 가장자리인 우회전차로를 따라 서행하면서 우회전하여야 하고, 우회전차로가 아닌 직진 차로를 따라 교차로에 진입하는 방법으로 우회전하여서는 아니된다."),

        Data(title="도로교통법위반\n",
            content="[판결요지]\n"
                +"피고인이 차량 보조 신호등이 설치된 교차로에서 신호를 위반하여 우회전하였다고 하여 도로교통법 위반으로 기소된 사안에서, \n" +
                    "차량 보조 신호등이 적색등인 경우 차량에 대하여 횡단보도 직전에 정지할 것과 우회전의 금지를 지시하는 것으로 보아야 하는데도, \n" +
                    "차량 보조 신호등이 원형 등화라는 이유만으로 우회전이 금지되는 것으로 볼 수 없다고 본 원심판단에 법리오해의 위법이 있다고 한 사례"),

        Data(title="교통사고처리특례법위반\n대법원 2010.07.22 선고 2010도1911 판결",
            content="[판결요지]\n"
                    +"승객이 안전 손잡이를 잡은 것을 확인하고 출발하여야 하고, 우회전이나 좌회전을 하는 경우에도 골프 카트의 좌우가 개방되어 있어 \n" +
                    "승객들이 떨어져서 다칠 우려가 있으므로 충분히 서행하면서 안전하게 좌회전이나 우회전을 하여야 할 업무상 주의의무가 있다."),

        Data(title="교통사고처리특례법위반\n대법원 1991.09.10 선고 91도1746 판결",
            content="[판결요지]\n"
                    +"우회전신호등까지도 켜지않는 상태였다면(원심의 피고인 1에 대한 판시내용도 우회전신호등을 켜는 등 주의의무를 다하지 아니하였음을 인정한 취지로 보인다), \n" +
                    "위 덤프트럭을 뒤따라 가던 피고인 2로서는 1차선으로 진입하던 위 덤프트럭이 사고장소에서 갑자기 우회전하여 2차선으로 다시 들어올 것을 예견하기는 어려운 상황이었다고 하지않을 수없다."),

        Data(title="구상금하집1988(1),304\n대구지법 1988.01.21 선고 87가합1583 제5민사부판결 : 항소",
            content="[판결요지]\n"
                    +"내지 15미터 지점에서 발견하고 급제동하였으나 미치지 못하고 추돌한 사고가 발생한 경우,\n" +
                    "위 사고지점이 터널을 통과한 직후의 오르막의 우회전 커브길이라면 위 트럭의 저속운행에는 상당한 이유가 있다 할 것이므로 \n" +
                    "트럭운전사에게 위 사고발생에 관하여 어떠한 과실이 있다고 볼 수 없다."),

        Data(title="교통사고처리특례법위반\n대법원 2011.07.28 선고 2011도3970 판결",
            content="[판결요지]\n"
                    +" '적색등화에 신호에 따라 진행하는 다른 차마의 교통을 방해하지 아니하고 우회전할 수 있다'는 구 도로교통법 시행규칙 제6조 제2항 [별표 2]의 취지\n" +
                    "[2] 택시 운전자인 피고인이 교차로에서 적색등화에 우회전하다가 신호에 따라 진행하던 피해자 운전의 승용차를 충격하여 그에게 상해를 입혔다고 하여 구 교통사고처리 특례법 위반으로 기소된 사안에서, "),

        Data(title="손해배상(자) 하집1997-2, 253\n서울고법 1997.08.27 선고 96나45704 판결：상고기각",
            content="[판결요지]\n"
                    +"서울 방면에서 인천 방면으로는 직진할 수 없고 경인국도 북쪽으로의 우회전과 경인국도 북쪽에서 인천방면으로의 우회전만 할 수 있도록 설치되어 있고, 지하차도가 시작되는 부분부터 우회전 곡각지점까지의 거리는 약 70m이며 우회전 지점에는 앞서 본 바와 같이 안전지대의 일종인 20㎝ 높이의 시멘트구조물(안전섬)이 설치되어 있다." ),

        Data(title="교통사고처리특례법위반\n대법원 1990.05.08 선고 90도606 판결",
            content="[판결요지]\n"
                    +"제한속도(시속 60킬로미터)의 범위 안에서 운행하였으며(시속 40 내지 50킬로미터), 비가 내려 노면이 미끄러운 상태였고, 피고인이 우회전을 하다가 전방에 정차하고 있는 버스를 발견하고 급제동조치를 취하였으나 빗길 때문에 미끄러져 미치지 못하고 중앙선을 침범하기에 이른 것이라면"),

        /*문장검색
        * Data(title="구상금하집1988(1),304\n대구지법 1988.01.21 선고 87가합1583 제5민사부판결 : 항소",
            content="[판결요지]\n"
                    +"내지 15미터 지점에서 발견하고 급제동하였으나 미치지 못하고 추돌한 사고가 발생한 경우,\n" +
                    "위 사고지점이 터널을 통과한 직후의 오르막의 우회전 커브길이라면 위 트럭의 저속운행에는 상당한 이유가 있다 할 것이므로 \n" +
                    "트럭운전사에게 위 사고발생에 관하여 어떠한 과실이 있다고 볼 수 없다."),
        * */
    )
}