package com.example.models

import com.example.RV.Data

object PrecedentList {
    val precedentlist = listOf<Data>(
        Data(title="교통사고처리특례법위반\n대법원 2011.07.28 선고 2009도8222 판결\n",
            content="[판결요지]\n"
                +"정지선에서 정지하여야 하고, 나아가 우회전하여서는 아니되며,\n"+"다만 횡단보도의 보행등이 적색으로 바뀌어 횡단보도로서의 성격\n"+"을 상실한 때에는 우회전 차량은 횡단보도를 통과하여 신호에 따라 진행하는 다른 차마의 교통을 방해하지 아니하고 우회전할 수 있다."),

        Data(title="교통사고처리특례법위반\n대법원 1986.11.25 선고 86도1802 판결\n",
            content="[판결요지]\n"
                    +"편도 1차선의 내리막 길에서 우회전 신호없이 우회전하다가 사고를 낸 버스운전사에게 업무상 과실책임을 인정한 예\n" +
                "시내버스 운전사가 편도 1차선의 약 10도정도 경사진 내리막길인 교차로에서 우회전 신호를 보내지도 않고 거울을 통하여 뒤따라 오는 차량이 있는지 여부를 확인함도 없이 우회전하다가 동버스의 우측 뒤를 따라오던 오토바이를 버스의 우측 뒷바퀴 부분 차체로 충격"),

        Data(title="도로교통법위반\n대법원 2012.04.12 선고 2011도9821 판결\n",
            content="[판결요지]\n"
                +"직진 차로에서 분리된 우회전차로가 설치되어 있는 교차로에서 우회전을 하고자 하는 운전자는 특별한 사정이 없는 한 도로 우측 가장자리인 우회전차로를 따라 서행하면서 우회전하여야 하고, 우회전차로가 아닌 직진 차로를 따라 교차로에 진입하는 방법으로 우회전하여서는 아니된다."),

        Data(title="도로교통법위반\n",
            content="[판결요지]\n"
                +"피고인이 차량 보조 신호등이 설치된 교차로에서 신호를 위반하여 우회전하였다고 하여 도로교통법 위반으로 기소된 사안에서, \n" +
                    "차량 보조 신호등이 적색등인 경우 차량에 대하여 횡단보도 직전에 정지할 것과 우회전의 금지를 지시하는 것으로 보아야 하는데도, \n" +
                    "차량 보조 신호등이 원형 등화라는 이유만으로 우회전이 금지되는 것으로 볼 수 없다고 본 원심판단에 법리오해의 위법이 있다고 한 사례"),

        Data(title="교통사고처리특례법위반\n대법원 2010.07.22 선고 2010도1911 판결",
            content="[판결요지]\n"
                    +"승객이 안전 손잡이를 잡은 것을 확인하고 출발하여야 하고, 우회전이나 좌회전을 하는 경우에도 골프 카트의 좌우가 개방되어 있어 \n" +
                    "승객들이 떨어져서 다칠 우려가 있으므로 충분히 서행하면서 안전하게 좌회전이나 우회전을 하여야 할 업무상 주의의무가 있다."),

        Data(title="교통사고처리특례법위반\n대법원 1991.09.10 선고 91도1746 판결",
            content="[판결요지]\n"
                    +"우회전신호등까지도 켜지않는 상태였다면(원심의 피고인 1에 대한 판시내용도 우회전신호등을 켜는 등 주의의무를 다하지 아니하였음을 인정한 취지로 보인다), \n" +
                    "위 덤프트럭을 뒤따라 가던 피고인 2로서는 1차선으로 진입하던 위 덤프트럭이 사고장소에서 갑자기 우회전하여 2차선으로 다시 들어올 것을 예견하기는 어려운 상황이었다고 하지않을 수없다."),

        Data(title="구상금하집1988(1),304\n대구지법 1988.01.21 선고 87가합1583 제5민사부판결 : 항소",
            content="[판결요지]\n"
                    +"내지 15미터 지점에서 발견하고 급제동하였으나 미치지 못하고 추돌한 사고가 발생한 경우,\n" +
                    "위 사고지점이 터널을 통과한 직후의 오르막의 우회전 커브길이라면 위 트럭의 저속운행에는 상당한 이유가 있다 할 것이므로 \n" +
                    "트럭운전사에게 위 사고발생에 관하여 어떠한 과실이 있다고 볼 수 없다."),

        Data(title="교통사고처리특례법위반\n대법원 2011.07.28 선고 2011도3970 판결",
            content="[판결요지]\n"
                    +" '적색등화에 신호에 따라 진행하는 다른 차마의 교통을 방해하지 아니하고 우회전할 수 있다'는 구 도로교통법 시행규칙 제6조 제2항 [별표 2]의 취지\n" +
                    "[2] 택시 운전자인 피고인이 교차로에서 적색등화에 우회전하다가 신호에 따라 진행하던 피해자 운전의 승용차를 충격하여 그에게 상해를 입혔다고 하여 구 교통사고처리 특례법 위반으로 기소된 사안에서, "),

        Data(title="손해배상(자) 하집1997-2, 253\n서울고법 1997.08.27 선고 96나45704 판결：상고기각",
            content="[판결요지]\n"
                    +"서울 방면에서 인천 방면으로는 직진할 수 없고 경인국도 북쪽으로의 우회전과 경인국도 북쪽에서 인천방면으로의 우회전만 할 수 있도록 설치되어 있고, 지하차도가 시작되는 부분부터 우회전 곡각지점까지의 거리는 약 70m이며 우회전 지점에는 앞서 본 바와 같이 안전지대의 일종인 20㎝ 높이의 시멘트구조물(안전섬)이 설치되어 있다." ),

        Data(title="교통사고처리특례법위반\n대법원 1990.05.08 선고 90도606 판결",
            content="[판결요지]\n"
                    +"제한속도(시속 60킬로미터)의 범위 안에서 운행하였으며(시속 40 내지 50킬로미터), 비가 내려 노면이 미끄러운 상태였고, 피고인이 우회전을 하다가 전방에 정차하고 있는 버스를 발견하고 급제동조치를 취하였으나 빗길 때문에 미끄러져 미치지 못하고 중앙선을 침범하기에 이른 것이라면"),

        Data(title="구상금하집1988(1),304\n대구지법 1988.01.21 선고 87가합1583 제5민사부판결 : 항소",
            content="[판결요지]\n"
                    +"내지 15미터 지점에서 발견하고 급제동하였으나 미치지 못하고 추돌한 사고가 발생한 경우,\n" +
                    "위 사고지점이 터널을 통과한 직후의 오르막의 우회전 커브길이라면 위 트럭의 저속운행에는 상당한 이유가 있다 할 것이므로 \n" +
                    "트럭운전사에게 위 사고발생에 관하여 어떠한 과실이 있다고 볼 수 없다."),

        //문장검색
        Data(title="교통사고처리특례법위반\n대법원 1992.01.21 선고 91도2330 판결",
            content="[판결요지]\n"
                    +"도로를 통행하는 보행자나 차마는 신호기 또는 안전표지가 표시하는 신호 또는 지시와 교통정리를 하는 경찰공무원 등의 신호나 지시를 따라야 하도록 되어 있는바, \n" +
                    "같은 법 제4조, 같은법시행규칙 제5조 별표 2, 3의 규정에 의하면 차마의 경우에 있어서 신호기가 표시하는 신호의 뜻은 "),

        Data(title="교통사고처리특례법위반\n대법원 1997.10.10 선고 97도1835 판결",
            content="[판결요지]\n"
                    +"이 사건 횡단보도에는 횡단보행자용 신호기만 설치되어 있고 별도의 차량용 신호기가 설치되어 있지 않으므로, \n" +
                    "이러한 경우 횡단보행자용 신호기의 신호가 보행자 통행신호인 녹색으로 되었을 때 차량 운전자가 횡단보도상을 운행하였다고 하여도 \n" +
                    "신호기의 신호에 위반하여 운전한 것이라고 할 수 없고"),

        Data(title="교통사고처리특례법위반등하집1991(2),344\n인천지법 1991.05.30 선고 90노1137 제1형사부판결 : 확정",
            content="[판결요지]\n"
                    +"횡단보도상의 보행자 진행신호의 지속시간이 도로의 횡단에 충분할 만큼 길지 못하여 횡단보도에서 대기하고 있다가 보행자 신호가 진행신호 바뀌자마자 횡단을 시작하더라도 \n" +
                    "미처 횡단을 끝마치기 전에 보행자 신호가 정지신호로 바뀌는 일이 비일비재한 현실정에서 보행신호주기 내에 횡단을 끝마치지 못하였다는 이유만으로 보행자 진행신호를 보고 횡단보도에 진입하여 횡단하던 보행자의 보호를 포기할 수는 없는 것으로서"),

        Data(title="교통사고처리특례법위반\n대법원 1994.08.23 선고 94도1199 판결",
            content="[판결요지]\n"
                    +"적색의 횡형삼색신호등(이하 이 사건 신호등이라 한다)이 차도측 양측면에 서로 반대방향(대전시내 쪽과 옥천 쪽으로)을 향하여 각 1개씩 설치되어 있는데, 그 곳에 설치된 횡단보도 보행자 신호등이 녹색신호일 때에는 적색신호를 , 적색신호일 때에는 녹색신호를 표시하고 있는 사실, \n" +
                    "한편 이 사건 교차로상에는 중앙선을 비롯한 차선이나 비보호좌회전표시 등 특별히 좌회전을 허용 또는 금지하는 표시가 설치되어 있지 아니한 사실 등을 인정한 다음"),

        Data(title="구상금\n대법원 1998.07.24 선고 98다18339 판결",
            content="[판결요지]\n"
                    +"의무전투경찰순경이 단독으로 교통정리를 위한 지시 또는 신호를 할 수 있는지 여부(적극)\n" +
                    "[2] 교통정리를 위한 수신호(수신호)의 실시 방법\n" +
                    "[3] 편도 3차선 도로 중 1, 2차선의 차량들이 모두 교통신호기상의 신호가 녹색신호임에도 의무전투경찰순경의 수신호에 따라 정지해 있는데도 교통신호기의 신호만을 보고 3차선을 따라 교차로에 진입하다가 수신호에 따라 교차로에 진입한 다른 차량과 충돌한 경우, 의무전투경찰순경에게 교통정리상의 과실이 없다고 본 사례"),

        Data(title="교통사고처리특례법위반\n대법원 1996.05.31 선고 95도3093 판결",
            content="[판결요지]\n"
                    +"전방의 삼색등 신호기가 적색인 상태에서 위와 같은 관행에 따라 유턴하다가 부암로터리 쪽에서 직진하여 오던 공소사실 기재 오토바이를 충격한 이 사건 교통사고를 일으킨 사실 등을 인정한 다음, \n" +
                    "위 사고지점 부근의 도로상황 및 신호관계, 차량의 통행관행, 사고경위 등을 종합하여 볼 때 위 사고 당시 피고인이 신호위반 또는 안전표지의 지시위반을 하였다거나 그와 같은 위반행위로 인하여 위 사고가 발생하였다고 볼 수 없고, 한편 피고인의 차량은 종합보험"),

        Data(title="교통사고처리특례법위반피고사건하집1987(3),513\n서울형사지법 1987.07.10 선고 87노2685 제7부판결 : 확정",
            content="[판결요지]\n"
                    +"안전과 원활한 소통을 확보하기 위하여 필요하다고 인정하는 때에는 신호기 및 안전표지를 설치하고 이를 관리하여야 하며 \n" +
                    "보행자나 차마는 신호기 또는 안전표지가 표시하는 신호 또는 지시와 교통정리를 하는 경찰공무원의 신호나 지시를 따라야 한다고 규정하고 있고, 한편 같은법 제22조 내지 제24조에서의 교차로에서의 통행방법"),

        Data(title="교통사고처리특례법위반\n인천지방법원 2009.07.31 선고 2009노1873 판결",
            content="[판결요지]\n"
                    +"교차로와 횡단보도가 인접하여 설치되어 있고 차량용 신호기는 교차로에만 설치된 경우에 있어서 차량용 신호기는 차량에 대하여 교차로의 통행은 물론 교차로 직전의 횡단보도에 대한 통행까지 아울러 지시하는 것인바, 피고인이 진행하였던 이 사건 사고 지점 직전의 횡단보도의 신호등은 보행자 진행신호인 녹색등이고,"),

        Data(title="교통사고처리특례법위반\n의정부지방법원 2016.10.07 선고 2015노3482 판결",
            content="[판결요지]\n"
                    +"운전자에게는 횡단보도의 보행자 신호만을 믿고 횡단보도를 통행하는 보행자가 있음을 예견하여 우회전 직후 설치되어 있는 횡단보도의 보행자 신호기가 녹색 등화인지 여부를 확인하여야 할 주의의무가 있고, \n" +
                    "위 횡단보도의 보행자 신호기가 녹색 등화인 경우에는 보행자의 횡단을 방해하거나 위험을 주지 아니하도록 일시정지하"),

        Data(title="교통사고처리특례법위반\n서울서부지방법원 2007.11.01 선고 2007노1189 판결",
            content="[판결요지]\n"
                    +"도로를 통행하는 보행자와 차마의 운전자는 교통안전시설이 표시하는 신호 또는 지시와 교통정리를 하는 경찰공무원 등의 신호나 지시를 따라야 하는 것이고(도로교통법 제5조 제1항), \n" +
                    "'보행신호등의 녹색등화의 점멸신호'의 뜻은 보행자는 횡단을 시작하여서는 아니 되고, 횡단하고 있는 보행자는 신속하게 횡단을 완료하거나 그 횡단을 중지하고 보도로 되돌아와야 한다는 것인바"),
    )
}