package com.example.models

import com.example.RV.Data

object PrecedentList {
    val precedentlist = listOf<Data>(
            Data(title = "대법원 2012. 4. 12. 선고 2011도9821 판결", content = "[판결요지]\n" +
                    "[1] 구 도로교통법(2010. 7. 23. 법률 제10382호로 개정되기 전의 것) 제25조 제1항 , 제2조 제12호 및 ‘도로의 구조·시설 기준에 관한 규칙’ 제2조 제24호 , 제43호 , 제32조 제3항 의 내용과 취지 등을 종합하면, 교통섬이 설치되고 그 오른쪽으로 직진 차로에서 분리된 우회전차로가 설치되어 있는 교차로에서 우회전을 하고자 하는 운전자는 특별한 사정이 없는 한 도로 우측 가장자리인 우회전차로를 따라 서행하면서 우회전하여야 하고, 우회전차로가 아닌 직진 차로를 따라 교차로에 진입하는 방법으로 우회전하여서는 아니된다.\n" +
                    "\n" +
                    "[2] 자동차 운전자인 피고인이, 교통섬이 설치되고 그 오른쪽으로 직진 차로에서 분리된 우회전차로가 설치되어 있는 교차로에서 우회전차로가 아닌 직진 2개 차로 중 오른쪽 차로를 따라 교차로에 진입하는 방법으로 우회전하였다고 하여 구 도로교통법(2010. 7. 23. 법률 제10382호로 개정되기 전의 것) 위반으로 기소된 사안에서, 위 교차로에서 우회전차로가 아닌 직진 차로의 우측 가장자리를 따라 교차로에 진입하는 방법으로 우회전할 수 있다는 전제하에 피고인의 행위가 같은 법 제25조 제1항 에서 정한 교차로 통행방법에 위배되지 않는다고 본 원심판결에 법리오해의 위법이 있다고 한 사례.") ,
            Data(title = "도로교통법위반\n" +
                    "[대법원 2017. 5. 11., 선고, 2017도2730, 판결]", content = "【판시사항】\n" +
                    "피고인이 차량 보조 신호등이 설치된 교차로에서 신호를 위반하여 우회전하였다고 하여 도로교통법 위반으로 기소된 사안에서, 차량 보조 신호등이 적색등인 경우 차량에 대하여 횡단보도 직전에 정지할 것과 우회전의 금지를 지시하는 것으로 보아야 하는데도, 차량 보조 신호등이 원형 등화라는 이유만으로 우회전이 금지되는 것으로 볼 수 없다고 본 원심판단에 법리오해의 위법이 있다고 한 사례\n" +
                    "\n" +
                    "【참조조문】\n" +
                    "도로교통법 제5조 제1항, 제156조 제1호, 도로교통법 시행규칙 제6조 제2항 [별표 2], 제7조 제1항 [별표 3]\n" +
                    "\n" +
                    "\n" +
                    "【전문】\n" +
                    "【피 고 인】\n" +
                    "【상 고 인】\n" +
                    "검사\n" +
                    "\n" +
                    "【변 호 인】\n" +
                    "법무법인 중원 담당변호사 강윤구\n" +
                    "\n" +
                    "【원심판결】\n" +
                    "대구지법 2017. 1. 26. 선고 2016노2419 판결\n" +
                    "\n" +
                    "【주 문】\n" +
                    "원심판결을 파기하고, 사건을 대구지방법원 본원 합의부에 환송한다.\n" +
                    "\n" +
                    "\n" +
                    "【이 유】\n" +
                    "상고이유를 판단한다. \n" +
                    "1.  이 사건 공소사실의 요지는, 피고인은 2015. 7. 28. 17:33경 부산 서구 동래구 소재 내성교차로를 교대 방면에서 동래경찰서 방면으로 우회전하였는데, 그 교차로는 차량 보조 신호등(이하 ‘이 사건 차량 보조 신호등’이라 한다)이 설치된 교차로이므로 운전자로서는 신호에 따라 운전하여야 함에도 피고인은 신호를 위반하여 우회전하여 진행하였다는 것이다.\n" +
                    "이에 대하여 원심은, ① 이 사건 차량 보조 신호등은 원형 등화일 뿐 화살표 등화가 아닌 이상, 적색 등화인 상태에서 우회전하였다는 사정만으로 신호위반을 하였다고 볼 수는 없고, ② 이 사건과 같이 교차로와 횡단보도가 연접하여 설치되어 있는 경우, 차량용 신호기가 차량에 대하여 교차로 직전의 횡단보도에 대한 통행까지도 지시하는 것으로 보아야 할 법적 근거가 없으므로, 피고인이 우회전할 당시 교차로에 설치된 차량용 신호기가 적색 등화였고, 횡단보도 보행신호등이 녹색등이었다고 하더라도 신호를 위반한 것으로 볼 수 없다고 보아 이 사건 공소사실에 대하여 무죄라고 판단하였다.\n" +
                    " \n" +
                    "2.  그러나 원심의 위와 같은 판단은 다음과 같은 점에 비추어 수긍하기 어렵다.\n" +
                    "원심은 이 사건 차량 보조 신호등은 원형 등화일 뿐이므로, 우회전을 금지하기 위해서는 화살표 등화를 사용하였어야 한다고 보았다. 그러나 화살표 등화는 구 도로교통법 시행규칙이 2010. 8. 24. 행정안전부령 제156호로 개정되면서 신설된 것이어서, 그 이전까지는 차량 신호등 중 ‘화살표 등화’는 존재하지 아니하여 이 사건 차량 보조 신호등과 같이 종형삼색등 형태의 원형 신호등이 설치되었고 아직까지 교체되지 못하고 사용되고 있는 것으로 보이는 점, 구 도로교통법 시행규칙(2010. 8. 24. 행정안전부령 제156호로 개정된 것, 이하 같다) 시행 이전에 횡단보도의 보행등 측면에 설치된 차량 보조등은 주신호등을 보조하기 위하여 도로 측면에 설치된 것으로서 차량용 신호등이었던 점, 구 도로교통법 시행규칙이 시행되었다고 하여 횡단보도의 보행등 측면에 설치된 차량 보조등의 이와 같은 성격이 변경되었다고 볼 수는 없는 점 등을 종합하여 보면, 이 사건 차량 보조 신호등이 적색등인 경우 차량에 대하여 횡단보도 직전에 정지할 것과 우회전의 금지를 지시하는 것으로 봄이 상당하므로, 원심이 이 사건 차량 보조 신호등이 화살표 등화가 아니라 원형 등화라는 이유만으로 우회전이 금지되는 것으로 볼 수 없다고 판단한 것은 도로교통법의 신호 또는 지시에 따를 의무에 관한 법리를 오해하여 판결에 영향을 미친 위법이 있다.\n" +
                    " \n" +
                    "3.  그러므로 원심판결을 파기하고, 사건을 다시 심리·판단하도록 원심법원에 환송하기로 하여, 관여 대법관의 일치된 의견으로 주문과 같이 판결한다.\n" +
                    "\n" +
                    "\n" +
                    "대법관 김용덕(재판장) 김신 김소영(주심) 이기택"),
                Data(title="도로교통법\n",content="[시행 2022. 7. 12.] [법률 제18741호, 2022. 1. 11., 일부개정]\n" +
                        "제25조(교차로 통행방법) ① 모든 차의 운전자는 교차로에서 우회전을 하려는 경우에는 미리 도로의 우측 가장자리를 서행하면서 우회전하여야 한다. 이 경우 우회전하는 차의 운전자는 신호에 따라 정지하거나 진행하는 보행자 또는 자전거등에 주의하여야 한다.  <개정 2020. 6. 9.>\n" +
                        "\n" +
                        "② 모든 차의 운전자는 교차로에서 좌회전을 하려는 경우에는 미리 도로의 중앙선을 따라 서행하면서 교차로의 중심 안쪽을 이용하여 좌회전하여야 한다. 다만, 시ㆍ도경찰청장이 교차로의 상황에 따라 특히 필요하다고 인정하여 지정한 곳에서는 교차로의 중심 바깥쪽을 통과할 수 있다.  <개정 2020. 12. 22.>\n" +
                        "\n" +
                        "③ 제2항에도 불구하고 자전거등의 운전자는 교차로에서 좌회전하려는 경우에는 미리 도로의 우측 가장자리로 붙어 서행하면서 교차로의 가장자리 부분을 이용하여 좌회전하여야 한다.  <개정 2020. 6. 9.>\n" +
                        "\n" +
                        "④ 제1항부터 제3항까지의 규정에 따라 우회전이나 좌회전을 하기 위하여 손이나 방향지시기 또는 등화로써 신호를 하는 차가 있는 경우에 그 뒤차의 운전자는 신호를 한 앞차의 진행을 방해하여서는 아니 된다.\n" +
                        "\n" +
                        "⑤ 모든 차 또는 노면전차의 운전자는 신호기로 교통정리를 하고 있는 교차로에 들어가려는 경우에는 진행하려는 진로의 앞쪽에 있는 차 또는 노면전차의 상황에 따라 교차로(정지선이 설치되어 있는 경우에는 그 정지선을 넘은 부분을 말한다)에 정지하게 되어 다른 차 또는 노면전차의 통행에 방해가 될 우려가 있는 경우에는 그 교차로에 들어가서는 아니 된다.  <개정 2018. 3. 27.>\n" +
                        "\n" +
                        "⑥ 모든 차의 운전자는 교통정리를 하고 있지 아니하고 일시정지나 양보를 표시하는 안전표지가 설치되어 있는 교차로에 들어가려고 할 때에는 다른 차의 진행을 방해하지 아니하도록 일시정지하거나 양보하여야 한다.\n" +
                        "\n" +
                        "[전문개정 2011. 6. 8.]\n" +
                        "\n" +
                        "제26조(교통정리가 없는 교차로에서의 양보운전) ① 교통정리를 하고 있지 아니하는 교차로에 들어가려고 하는 차의 운전자는 이미 교차로에 들어가 있는 다른 차가 있을 때에는 그 차에 진로를 양보하여야 한다.\n" +
                        "\n" +
                        "② 교통정리를 하고 있지 아니하는 교차로에 들어가려고 하는 차의 운전자는 그 차가 통행하고 있는 도로의 폭보다 교차하는 도로의 폭이 넓은 경우에는 서행하여야 하며, 폭이 넓은 도로로부터 교차로에 들어가려고 하는 다른 차가 있을 때에는 그 차에 진로를 양보하여야 한다.\n" +
                        "\n" +
                        "③ 교통정리를 하고 있지 아니하는 교차로에 동시에 들어가려고 하는 차의 운전자는 우측도로의 차에 진로를 양보하여야 한다.\n" +
                        "\n" +
                        "④ 교통정리를 하고 있지 아니하는 교차로에서 좌회전하려고 하는 차의 운전자는 그 교차로에서 직진하거나 우회전하려는 다른 차가 있을 때에는 그 차에 진로를 양보하여야 한다.\n" +
                        "\n" +
                        "[전문개정 2011. 6. 8.]\n" +
                        "\n" +
                        "제27조(보행자의 보호) ① 모든 차 또는 노면전차의 운전자는 보행자(제13조의2제6항에 따라 자전거등에서 내려서 자전거등을 끌거나 들고 통행하는 자전거등의 운전자를 포함한다)가 횡단보도를 통행하고 있거나 통행하려고 하는 때에는 보행자의 횡단을 방해하거나 위험을 주지 아니하도록 그 횡단보도 앞(정지선이 설치되어 있는 곳에서는 그 정지선을 말한다)에서 일시정지하여야 한다.  <개정 2018. 3. 27., 2020. 6. 9., 2022. 1. 11.>\n" +
                        "\n" +
                        "② 모든 차 또는 노면전차의 운전자는 교통정리를 하고 있는 교차로에서 좌회전이나 우회전을 하려는 경우에는 신호기 또는 경찰공무원등의 신호나 지시에 따라 도로를 횡단하는 보행자의 통행을 방해하여서는 아니 된다.  <개정 2018. 3. 27.>\n" +
                        "\n" +
                        "③ 모든 차의 운전자는 교통정리를 하고 있지 아니하는 교차로 또는 그 부근의 도로를 횡단하는 보행자의 통행을 방해하여서는 아니 된다.\n" +
                        "\n" +
                        "④ 모든 차의 운전자는 도로에 설치된 안전지대에 보행자가 있는 경우와 차로가 설치되지 아니한 좁은 도로에서 보행자의 옆을 지나는 경우에는 안전한 거리를 두고 서행하여야 한다.\n" +
                        "\n" +
                        "⑤ 모든 차 또는 노면전차의 운전자는 보행자가 제10조제3항에 따라 횡단보도가 설치되어 있지 아니한 도로를 횡단하고 있을 때에는 안전거리를 두고 일시정지하여 보행자가 안전하게 횡단할 수 있도록 하여야 한다.  <개정 2018. 3. 27.>\n" +
                        "\n" +
                        "⑥ 모든 차의 운전자는 다음 각 호의 어느 하나에 해당하는 곳에서 보행자의 옆을 지나는 경우에는 안전한 거리를 두고 서행하여야 하며, 보행자의 통행에 방해가 될 때에는 서행하거나 일시정지하여 보행자가 안전하게 통행할 수 있도록 하여야 한다.  <개정 2022. 1. 11.>\n" +
                        "\n" +
                        "1. 보도와 차도가 구분되지 아니한 도로 중 중앙선이 없는 도로\n" +
                        "\n" +
                        "2. 보행자우선도로\n" +
                        "\n" +
                        "3. 도로 외의 곳\n" +
                        "\n" +
                        "⑦ 모든 차 또는 노면전차의 운전자는 제12조제1항에 따른 어린이 보호구역 내에 설치된 횡단보도 중 신호기가 설치되지 아니한 횡단보도 앞(정지선이 설치된 경우에는 그 정지선을 말한다)에서는 보행자의 횡단 여부와 관계없이 일시정지하여야 한다.  <신설 2022. 1. 11.>\n" +
                        "\n" +
                        "[전문개정 2011. 6. 8.]\n" +
                        "\n" +
                        "제28조(보행자전용도로의 설치) ① 시ㆍ도경찰청장이나 경찰서장은 보행자의 통행을 보호하기 위하여 특히 필요한 경우에는 도로에 보행자전용도로를 설치할 수 있다.  <개정 2020. 12. 22.>\n" +
                        "\n" +
                        "② 차마 또는 노면전차의 운전자는 제1항에 따른 보행자전용도로를 통행하여서는 아니 된다. 다만, 시ㆍ도경찰청장이나 경찰서장은 특히 필요하다고 인정하는 경우에는 보행자전용도로에 차마의 통행을 허용할 수 있다.  <개정 2018. 3. 27., 2020. 12. 22.>\n" +
                        "\n" +
                        "③ 제2항 단서에 따라 보행자전용도로의 통행이 허용된 차마의 운전자는 보행자를 위험하게 하거나 보행자의 통행을 방해하지 아니하도록 차마를 보행자의 걸음 속도로 운행하거나 일시정지하여야 한다.\n" +
                        "\n" +
                        "[전문개정 2011. 6. 8.]")
    )

}